export const dataDefault = {
  description: {
    short:
      "Однодневные контактные линзы премиум-класса созданы по технологии Lacreon, что позволяет наделить материал " +
      "линзы увлажняющим агентом. Это даёт возможность не только дополнительно увлажнять глазную поверхность, но и " +
      "держать 100% увлажняющий компонент внутри линз на протяжении всего дня. Кроме этого, такие линзы блокируют " +
      "поступление УФ-A лучей (более 70%) и УФ-В лучей (95 %). Линзы изготовлены из безопасного и современного материала " +
      "этафилкон",
    full:
      "Смартфон Xiaomi Redmi 6A 2/16GB относится к линейке бюджетных и подойдёт для выполнения любых повседневных " +
      "задач. Четырёхъядерный процессор MediaTek Helio A22 делает гаджет функциональным и выносливым, а аккумулятор " +
      "3000 mAh обеспечит его непрерывное использование на протяжении целого дня.<p>Большой дисплей с диагональю 5.45 " +
      "дюйма и соотношением сторон 18:9 покорит сердце киномана. Смотреть фильмы и сериалы на таком экране — одно " +
      "удовольствие, а IPS-матрица обеспечит интенсивную цветопередачу и отличную детализацию. Любители памятных фото " +
      "и видео получат яркие кадры благодаря тыловой камере разрешением 13 Мп и фокусировке PDAF, которая " +
      "сосредотачивается на предметах во время движения. Фронтальная камера с эффектами улучшения фото Beautify позволит " +
      "делать яркие и запоминающиеся селфи.</p><p>Плавную и эффективную работу гаджета обеспечивает ОС Android 8.1. Для " +
      "хранения информации предусмотрено 16 Гб встроенной памяти, которую можно расширить с помощью карты microSD " +
      "объёмом до 256 Гб. Для доступа к интернету в любом месте предусмотрены модули 4G и Wi-Fi.</p><p>Смартфон оснащён " +
      "технологией распознавания лиц, благодаря чему разблокировку можно осуществить одним взглядом на экран. Главное " +
      "преимущество — данные владельца будут надежно защищены от посторонних посягательств. Гаджет имеет тонкий корпус с " +
      "плавными линиями и хорошо ложится даже в небольшую женскую ладонь. Несмотря на внушительный размер экрана, им " +
      "удобно управлять одной рукой.</p>"
  },
  specs: [
    {
      groupName: "Общие характеристики",
      groupSpecs: [
        { name: "Тип", value: "смартфон" },
        { name: "Операционная система", value: "Android" },
        { name: "Тип корпуса", value: "классический" },
        { name: "Материал корпуса", value: "пластик" },
        { name: "Количество SIM-карт", value: "2" },
        { name: "Тип SIM-карты", value: "nano SIM" },
        { name: "Режим работы нескольких SIM-карт", value: "попеременный" },
        { name: "Вес", value: "145 г" },
        { name: "Размеры (ШxВxТ)", value: "71.5x147.5x8.3 мм" }
      ]
    },
    {
      groupName: "Экран",
      groupSpecs: [
        { name: "Тип экрана", value: "цветной IPS, 16 млн цветов, сенсорный" },
        { name: "Тип сенсорного экрана", value: "мультитач, емкостный" },
        { name: "Диагональ", value: "5.45 дюйм." },
        { name: "Размер изображения", value: "1440x720" },
        { name: "Число пикселей на дюйм (PPI)", value: "295" },
        { name: "Соотношение сторон", value: "18:9" },
        { name: "Автоматический поворот экрана", value: "есть" }
      ]
    },
    {
      groupName: "Мультимедийные возможности",
      groupSpecs: [
        { name: "Количество основных (тыловых) камер", value: "1" },
        { name: "Разрешение основной (тыловой) камеры", value: "13 МП" },
        { name: "Диафрагма основной (тыловой) камеры", value: "F/2.20" },
        { name: "Фотовспышка", value: "тыльная, светодиодная" },
        { name: "Функции основной (тыловой) фотокамеры", value: "автофокус" },
        { name: "Запись видеороликов", value: "есть" },
        { name: "Макс. разрешение видео", value: "1920x1080" },
        { name: "Макс. частота кадров видео", value: "30 кадров/с" },
        { name: "Фронтальная камера", value: "есть, 5 МП" },
        { name: "Аудио", value: "MP3, AAC, WAV, WMA" },
        { name: "Разъем для наушников", value: "3.5 мм" }
      ]
    }
  ]
};
